#columns in each table are reffered to as a series and each table is a dataframe
#dataframes are 2 dimensional data structures with rows and columns like excel 
#series are 1 dimensional data structures like lists or tuples
#after initialization using the pandas library, we can apply several functions on them

In [50]:
import pandas as pd

In [51]:
df = pd.DataFrame({ "Name" : ["Ama", "Nana", "Mimi", "Jenny" , "NAS" , "Alex"],
                     "Sex" : ["Female","Male", "Female", "Female", "Female","Female"],
                     "Age" : [21, 19, 19, 23, 22, 20]
    
})

In [52]:
df

    Name     Sex  Age
0    Ama  Female   21
1   Nana    Male   19
2   Mimi  Female   19
3  Jenny  Female   23
4    NAS  Female   22
5   Alex  Female   20

In [53]:
#columns can be selected like this
#the following output will be a series
#multiple columns can be selected at once too
df["Name"]

0      Ama
1     Nana
2     Mimi
3    Jenny
4      NAS
5     Alex
Name: Name, dtype: object

In [54]:
#creating a series from scratch
series = pd.Series([23,45, 19, 20], name= "Ages")

In [55]:
series

0    23
1    45
2    19
3    20
Name: Ages, dtype: int64

Applying functions on DataFrames and Series

In [56]:
#maximum function gives the largest age in the dataset
df["Age"].max()

23

In [57]:
#same for series too
series.max()

45

In [ ]:
#describes the dataset, numerical values
df.describe()

             Age
count   6.000000
mean   20.666667
std     1.632993
min    19.000000
25%    19.250000
50%    20.500000
75%    21.750000
max    23.000000